interface Preset {
  [key: string]: any
}

const preset: Preset = {
  // 全掩码
  all: ['^(.*)$', '{{*$1}}'],
  // 银行卡号：*(实际位数)+显示最后4位，如**********8639
  bankNo: ['^(.*)(.{4})$', '{{*$1}}$2'],
  // 证件号：显示前3位+ *(实际位数)+后2-4位+*(最后1位屏蔽)
  certNo: ['^(.{3})(.*)(.{3})(.{1})$', '$1{{*$2}}$3{{*$4}}'],
  // 姓名：显示最后一位
  name: ['^(.*)(.{1})$', '{{*$1}}$2'],
  phoneNo: {
    // 大陆手机号：1开头，后面跟10个数字，显示前2位和后3位，其他掩码
    '^1[0-9]{10}': ['^([0-9]{3})([0-9]*)([0-9]{2})$', '$1{{*$2}}$3'],
    // 香港手机号：9或6开头后面跟7位数字，显示前2位和后2位，其他掩码
    '^([6|9])\\d{7}$': ['^([0-9]{2})([0-9]*)([0-9]{2})$', '$1{{*$2}}$3'],
    // 澳门手机号：66或68开头后面跟5位数字，显示前2位和后2位，其他掩码
    '^[6]([8|6])\\d{5}$': ['^([0-9]{2})([0-9]*)([0-9]{2})$', '$1{{*$2}}$3'],
    // 台湾手机号：66或68开头后面跟5位数字，显示前2位和后2位，其他掩码
    '^[0][9]\\d{8}$': ['^([0-9]{2})([0-9]*)([0-9]{3})$', '$1{{*$2}}$3'],
    // 其他手机号：显示前2和后2
    '^.*$': ['^([0-9]{2})([0-9]*)([0-9]{2})$', '$1{{*$2}}$3'],
  },
  landline: {
    // 默认固定电话，显示区号和后两位
    '0\\d{2,3}-[1-9]\\d{6,7}': ['^(0[0-9]{2,3})-([0-9]*)([0-9]{2})', '$1-{{*$2}}$3'],
    // 其他显示后两位
    '^.*$': ['^(.*)(.{2})$', '{{*$1}}$2'],
  },
  email: {
    // 如果@前面少于3位，则都显示，再@前面加***，如ab@111.com，显示位ab***@111.com
    '^.{1,2}@.*$': ['^(.{1,2})@(.*)$', '$1***@$2'],
    // 如果@签名多于3位，则掩码@前面3个字符
    '^.*@.*$': ['^(.*)(.{3})@(.*)$', '$1{{*$2}}@$3'],
    // 都匹配不上就全掩码
    '^.*$': 'all',
  },
  // 金额相关信息全掩码
  money: 'all',
  // 验证码全掩码
  verificationCode: 'all',
  // 地址全掩码
  address: 'all',
};

export default preset;
